---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.EnergyAnalysisOpeningType.Skylight
enum: Autodesk.Revit.DB.Analysis.EnergyAnalysisOpeningType
source: html/e18708e5-0036-d48b-dce4-9efcc840d6be.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisOpeningType.Skylight

Skylight.